Autodesk.Navisworks.Api.BoundingBox3D
Axis aligned 3D bounding box. Immutable.

Autodesk.Navisworks.Api.BoundingBox3D.#ctor
Create an empty bounding box

Autodesk.Navisworks.Api.BoundingBox3D.#ctor(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D)
Create a bounding box from a min and max point that define the opposite corners of the box
Throws System.ArgumentNullException:
Argument 'minPoint' is null
Throws System.ArgumentException:
Argument 'minPoint' has been Disposed
Throws System.ArgumentOutOfRangeException:
A component of minPosition is greater than the corresponding component of maxPosition
Throws System.ArgumentNullException:
Argument 'maxPoint' is null
Throws System.ArgumentException:
Argument 'maxPoint' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Center
Center of bounding box
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.ClosestPoint(Autodesk.Navisworks.Api.Point3D)
Computes closest point in box to a given point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Contains(Autodesk.Navisworks.Api.BoundingBox3D)
True if this completely contains box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Contains(Autodesk.Navisworks.Api.Point3D)
True if this contains point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Empty
Returns an empty bounding box

Autodesk.Navisworks.Api.BoundingBox3D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.BoundingBox3D.Extend(Autodesk.Navisworks.Api.BoundingBox3D)
Return box that represents union of this with another box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Extend(Autodesk.Navisworks.Api.Point3D)
Return box that represents union of this with another point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.BoundingBox3D.HasSurfaceArea
Does bounding box have a non-zero surface area ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.HasVolume
Does bounding box have a non-zero volume ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Intersect(Autodesk.Navisworks.Api.BoundingBox3D)
Return box that represents intersection of this with another box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Intersects(Autodesk.Navisworks.Api.BoundingBox3D)
True if this intersects box
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'box' is null
Throws System.ArgumentException:
Argument 'box' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Intersects(Autodesk.Navisworks.Api.Point3D)
True if this intersects point (same as Contains() for a point)
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.IsEmpty
Is bounding box empty ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.BoundingBox3D.Max
Return max point that defines corner of box with largest values for all components
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Min
Return min point that defines corner of box with smallest values for all components
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Size
Extents of bounding box from min point to max point
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.SurfaceArea
Sum of the areas of the faces of the bounding box, 0 if empty
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.BoundingBox3D.Translate(Autodesk.Navisworks.Api.Vector3D)
Return this box translated by an offset
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'offset' is null
Throws System.ArgumentException:
Argument 'offset' has been Disposed

Autodesk.Navisworks.Api.BoundingBox3D.Volume
Volume of bounding box, 0 if empty
Throws System.ObjectDisposedException:
Object has been Disposed